tap "coursier/formulas"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sass/sass"
tap "teamookla/speedtest"
tap "jesseduffield/lazygit"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "armadillo"
brew "automake"
brew "bear"
brew "bison"
brew "icu4c@76", link: true
brew "boost"
brew "chruby"
brew "docker"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "go"
brew "gsl"
brew "helm"
brew "htop"
brew "hugo"
brew "ifstat"
brew "libheif"
brew "libomp"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "libffi"
brew "libyaml"
brew "llvm"
brew "lua"
brew "luarocks"
brew "mas"
brew "micro"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
# brew "openssl@1.1"  # Disabled - no longer supported upstream (disabled 2024-10-24)
brew "pandoc"
brew "pipx"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby-install"
brew "sbt"
brew "scala"
brew "stern"
brew "stow"
brew "switchaudio-osx"
brew "tailwindcss"
# brew "task"  # Removed - Taskwarrior no longer needed
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
# ============================================================================
# MODERN CLI TOOLS - Enhanced Command Line Experience
# ============================================================================

# Core Enhanced Utilities
brew "eza"                    # Modern replacement for ls with colors and icons
brew "bat"                    # Cat with syntax highlighting and Git integration
brew "fd"                     # Fast and user-friendly alternative to find
brew "zoxide"                 # Smarter cd command that learns your habits
brew "atuin"                  # Better shell history with sync and search
brew "dust"                   # More intuitive version of du
brew "duf"                    # Better df alternative with colors
brew "procs"                  # Modern replacement for ps
brew "btop"                   # Resource monitor (better htop/top)
brew "bandwhich"              # Network utilization by process
brew "hyperfine"              # Command-line benchmarking tool
brew "tokei"                  # Fast code statistics
brew "lsd"                    # Next gen ls command with icons
brew "delta"                  # Better git diff viewer
brew "gitui"                  # Terminal UI for Git
brew "yazi"                   # Terminal file manager
brew "zellij"                 # Terminal workspace manager
brew "starship"               # Fast and customizable prompt
brew "mcfly"                  # Upgraded ctrl-r with neural networks
brew "broot"                  # Better way to navigate directories

# System Monitoring & Info
brew "neofetch"               # System information
brew "bottom"                 # Alternative to top and htop
brew "glances"                # System monitoring tool
brew "speedtest-cli"          # Internet speed test

# Development Tools
brew "lazygit"                # Git terminal UI
brew "glow"                   # Markdown renderer
brew "tldr"                   # Simplified man pages

# Network & Download Tools
brew "aria2"                  # Download manager
brew "httpie"                 # HTTP client

# File Management
brew "trash"                  # Safe rm replacement

# Text Processing
brew "choose"                 # Human-friendly cut alternative
brew "sad"                    # Space Age seD

brew "yt-dlp"                  # Modern youtube-dl replacement (better than deprecated youtube-dl)
brew "zsh"
brew "coursier/formulas/coursier"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
brew "jesseduffield/lazygit"
cask "aerospace"
cask "alacritty"
cask "bootstrap-studio"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "linearmouse"
cask "sf-symbols"

# Taps
tap "coursier/formulas"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sass/sass"
tap "teamookla/speedtest"
tap "withgraphite/tap"

# Formulae
brew "air"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "armadillo"
brew "atuin"
brew "automake"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bear"
brew "bison"
brew "boost"
brew "bottom"
brew "broot"
brew "btop"
brew "choose"
brew "chruby"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gitui"
brew "glances"
brew "glow"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gsl"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "icu4c@76", link: true
brew "ifstat"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "llvm"
brew "lsd"
brew "lua"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "mdq"
brew "micro"
brew "neofetch"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "pandoc"
brew "pdfly"
brew "pipx"
brew "postgresql@14"
brew "procs"
brew "pytest"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby-install"
brew "sad"
brew "sbt"
brew "scala"
brew "skaffold"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "stow"
brew "switchaudio-osx"
brew "tailwindcss"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yamllint"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "coursier/formulas/coursier"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "go-task/tap/go-task"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
brew "withgraphite/tap/graphite"

# Casks
cask "aerospace"
cask "alacritty"
cask "bootstrap-studio"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "linearmouse"
cask "mactex"
cask "sf-symbols"

# Mac App Store
mas "AdBlock Pro", id: 1018301773
mas "CapCut", id: 1500855883
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Ebook Converter", id: 1081457679
mas "Flow", id: 1423210932
mas "keymapp", id: 6472865291
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "reMarkable", id: 1276493162
mas "Timery", id: 1425368544

# VS Code Extensions
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "postman.postman-for-vscode"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "vscodevim.vim"

# Taps
tap "coursier/formulas"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sass/sass"
tap "teamookla/speedtest"
tap "withgraphite/tap"

# Formulae
brew "air"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "armadillo"
brew "atuin"
brew "automake"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bear"
brew "bison"
brew "boost"
brew "bottom"
brew "broot"
brew "btop"
brew "choose"
brew "chruby"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gitui"
brew "glances"
brew "glow"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gsl"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "icu4c@76", link: true
brew "ifstat"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "llvm"
brew "lsd"
brew "lua"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "mdq"
brew "micro"
brew "neofetch"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "pandoc"
brew "pdfly"
brew "pipx"
brew "postgresql@14"
brew "procs"
brew "pytest"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby-install"
brew "sad"
brew "sbt"
brew "scala"
brew "skaffold"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "stow"
brew "switchaudio-osx"
brew "tailwindcss"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yamllint"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "coursier/formulas/coursier"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "go-task/tap/go-task"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
brew "withgraphite/tap/graphite"

# Casks
cask "aerospace"
cask "alacritty"
cask "bootstrap-studio"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "linearmouse"
cask "mactex"
cask "sf-symbols"

# Mac App Store
mas "AdBlock Pro", id: 1018301773
mas "CapCut", id: 1500855883
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Ebook Converter", id: 1081457679
mas "Flow", id: 1423210932
mas "keymapp", id: 6472865291
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "reMarkable", id: 1276493162
mas "Timery", id: 1425368544

# VS Code Extensions
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "postman.postman-for-vscode"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "vscodevim.vim"

# Taps
tap "coursier/formulas"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sass/sass"
tap "teamookla/speedtest"
tap "withgraphite/tap"

# Formulae
brew "air"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "armadillo"
brew "atuin"
brew "automake"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bear"
brew "bison"
brew "boost"
brew "bottom"
brew "broot"
brew "btop"
brew "choose"
brew "chruby"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gitui"
brew "glances"
brew "glow"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gsl"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "icu4c@76", link: true
brew "ifstat"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "llvm"
brew "lsd"
brew "lua"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "mdq"
brew "micro"
brew "neofetch"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "pandoc"
brew "pdfly"
brew "pipx"
brew "postgresql@14"
brew "procs"
brew "pytest"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby-install"
brew "sad"
brew "sbt"
brew "scala"
brew "skaffold"
brew "speedtest-cli"
brew "starship"
brew "stern"
brew "stow"
brew "switchaudio-osx"
brew "tailwindcss"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yamllint"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "coursier/formulas/coursier"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "go-task/tap/go-task"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
brew "withgraphite/tap/graphite"

# Casks
cask "aerospace"
cask "alacritty"
cask "bootstrap-studio"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "linearmouse"
cask "mactex"
cask "sf-symbols"

# Mac App Store
mas "AdBlock Pro", id: 1018301773
mas "CapCut", id: 1500855883
mas "Craft", id: 1487937127
mas "Dark Noise", id: 1465439395
mas "Ebook Converter", id: 1081457679
mas "Flow", id: 1423210932
mas "keymapp", id: 6472865291
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "reMarkable", id: 1276493162
mas "Timery", id: 1425368544

# VS Code Extensions
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "postman.postman-for-vscode"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "vscodevim.vim"
