tap "coursier/formulas"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sass/sass"
tap "teamookla/speedtest"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "armadillo"
brew "automake"
brew "bear"
brew "bison"
brew "icu4c@76", link: true
brew "boost"
brew "chruby"
brew "docker"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "go"
brew "gsl"
brew "helm"
brew "htop"
brew "hugo"
brew "ifstat"
brew "libheif"
brew "libomp"
brew "imagemagick"
brew "ipython"
brew "jq"
brew "libffi"
brew "libyaml"
brew "llvm"
brew "lua"
brew "luarocks"
brew "mas"
brew "micro"
brew "neovim"
brew "nnn"
brew "node"
brew "nowplaying-cli"
brew "openssl@1.1"
brew "pandoc"
brew "pipx"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby-install"
brew "sbt"
brew "scala"
brew "stern"
brew "stow"
brew "switchaudio-osx"
brew "tailwindcss"
brew "task"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "coursier/formulas/coursier"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
cask "aerospace"
cask "alacritty"
cask "bootstrap-studio"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "linearmouse"
cask "sf-symbols"
